# -*- coding: utf-8 -*-
import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family']='SimHei'#字体设置黑体
demo_x=[500,600,700,800,900,1000,1100,1200,1300,1400,1500]
demo2_x=[0.5,1.5,2.5,3.5,4.5,5.5,6.5,7.5,8.5,9.5]
plt.subplot(2,2,1)
plt.title('硅光电池实验_软件工程16-1_罗浩楠')
plt.axis([500,1550,100,350])
plt.plot(demo_x,[103,125,146,168,189,211,232,253,275,296,317],'k')
plt.plot(demo_x,[105,127,148,170,192,214,236,258,280,301,323],'k:')
plt.plot([600,800],[300,300],'k')
plt.text(800,300,r'零偏')
plt.plot([600,800],[275,275],'k:')
plt.text(800,275,r'反偏')
plt.subplot(2,2,2)
plt.axis([500,1550,20,200])
plt.plot(demo_x,[32,39,45,52,59,65,72,79,85,92,98],'k')
plt.plot([500,600],[20,300],'k:')
plt.plot([600,800],[175,175],'k')
plt.text(800,175,r'1K欧姆')
plt.plot([600,800],[160,160],'k:')
plt.text(800,160,r'10K欧姆')
plt.subplot(2,2,3)
plt.axis([0.5,10,0,1000])
plt.plot(demo2_x,[21,63,104,146,187,229,270,311,352,393],'k') 
plt.plot(demo2_x,[44,131,219,306,393,480,567,653,740,827],'k:')
plt.plot(demo2_x,[66,197,328,457,588,718,848,976,1103,1229],'k--')
plt.plot([0.5,2.5],[850,850],'k')
plt.plot([0.5,2.5],[750,750],'k:')
plt.plot([0.5,2.5],[650,650],'k--')
plt.text(2.5,850,r'500')
plt.text(2.5,750,r'1000')
plt.text(2.5,650,r'1500')
plt.subplot(2,2,4)
plt.axis([0,70,40,100])
plt.plot([1,10,20,30,40,50,60],[96,90,82.4,72.8,64.8,55.2,49.6],'k')
plt.plot([1,10,20,30,40,50,60],[73.5,68.2,66.0,58.3,50.3,47.5,45.2],'k:')
plt.plot([45,60],[90,90],'k')
plt.plot([45,60],[80,80],'k:')
plt.text(60,90,r'零偏')
plt.text(60,80,r'反偏')
plt.grid(True)#网格显示
plt.savefig(r'D:\\a.PNG',dpi=600)#保存PNG图片
plt.show()

